## Lab | Customer Analysis Round 1
#### Remember the process:

1. Case Study
2. Get data
3. Cleaning/Wrangling/EDA
4. Processing Data
5. Modeling
6. Validation
7. Reporting

#### Abstract
The objective of this data is to understand customer demographics and buying behavior. Later during the week, we will use predictive analytics to analyze the most profitable customers and how they interact. After that, we will take targeted actions to increase profitable customer response, retention, and growth.

For this lab, we will gather the data from 3 csv files that are provided in the files_for_lab folder. Use that data and complete the data cleaning tasks as mentioned later in the instructions.

#### Instructions:
+ Read the three files into python as dataframes

+ Show the DataFrame's shape.

+ Standardize header names.

+ Rearrange the columns in the dataframe as needed

+ Concatenate the three dataframes

+ Which columns are numerical?

+ Which columns are categorical?

+ Understand the meaning of all columns

+ Perform the data cleaning operations mentioned so far in class

    + Delete the column education and the number of open complaints from the dataframe.
    + Correct the values in the column customer lifetime value. They are given as a percent, so multiply them by 100 and change dtype to numerical type.
    + Check for duplicate rows in the data and remove if any.
    + Filter out the data for customers who have an income of 0 or less.

In [1]:
import numpy as np
import pandas as pd

### Read the three files into python as dataframes

In [2]:
df1 = pd.read_csv('file1.csv')
df2 = pd.read_csv('file2.csv')
df3 = pd.read_csv('file3.csv')

### Show the DataFrame's shape.

In [3]:
df1.shape

(4008, 11)

In [4]:
df2.shape

(996, 11)

In [5]:
df3.shape

(7070, 11)

### Standardize header names.

In [6]:
df1.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [7]:
df2.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Total Claim Amount', 'Policy Type', 'Vehicle Class'],
      dtype='object')

In [8]:
df3.columns

Index(['Customer', 'State', 'Customer Lifetime Value', 'Education', 'Gender',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Total Claim Amount', 'Vehicle Class'],
      dtype='object')

In [9]:
cols = []
for i in range(len(df1.columns)):
    cols.append(df1.columns[i].lower())
cols

['customer',
 'st',
 'gender',
 'education',
 'customer lifetime value',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'policy type',
 'vehicle class',
 'total claim amount']

In [10]:
df1.columns = cols
df1.columns

Index(['customer', 'st', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount'],
      dtype='object')

In [11]:
df2.columns = df2.columns.str.lower()

In [12]:
df3.columns = df3.columns.str.lower()

In [13]:
df1 = df1.rename(columns={'st': 'state'})
df1.columns

Index(['customer', 'state', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount'],
      dtype='object')

In [14]:
df2 = df2.rename(columns={'st': 'state'})

### Rearrange the columns in the dataframe as needed

In [15]:
df2 = df2[['customer', 'state', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount']]
df2.columns

Index(['customer', 'state', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount'],
      dtype='object')

In [16]:
df3 = df3[['customer', 'state', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount']]
df3.columns

Index(['customer', 'state', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount'],
      dtype='object')

### Concatenate the three dataframes

In [17]:
df=pd.concat([df1,df2,df3],axis=0)

In [18]:
df.head()

,customer,state,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [19]:
def standardize_col(col):
    return col.replace(" ", "_")

In [20]:
stdzd_cols = []
for col in df.columns.to_list():
    stdzd_cols.append(standardize_col(col))
stdzd_cols

['customer',
 'state',
 'gender',
 'education',
 'customer_lifetime_value',
 'income',
 'monthly_premium_auto',
 'number_of_open_complaints',
 'policy_type',
 'vehicle_class',
 'total_claim_amount']

In [21]:
df.columns = stdzd_cols

In [22]:
df.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [23]:
df.shape

(12074, 11)

In [24]:
df.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value       object
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

### Which columns are numerical?

In [25]:
df.select_dtypes(np.number)

       income  monthly_premium_auto  total_claim_amount
0         0.0                1000.0            2.704934
1         0.0                  94.0         1131.464935
2     48767.0                 108.0          566.472247
3         0.0                 106.0          529.881344
4     36357.0                  68.0           17.269323
...       ...                   ...                 ...
7065  71941.0                  73.0          198.234764
7066  21604.0                  79.0          379.200000
7067      0.0                  85.0          790.784983
7068  21941.0                  96.0          691.200000
7069      0.0                  77.0          369.600000

[12074 rows x 3 columns]

In [26]:
df_nums = df._get_numeric_data()
df_nums

       income  monthly_premium_auto  total_claim_amount
0         0.0                1000.0            2.704934
1         0.0                  94.0         1131.464935
2     48767.0                 108.0          566.472247
3         0.0                 106.0          529.881344
4     36357.0                  68.0           17.269323
...       ...                   ...                 ...
7065  71941.0                  73.0          198.234764
7066  21604.0                  79.0          379.200000
7067      0.0                  85.0          790.784983
7068  21941.0                  96.0          691.200000
7069      0.0                  77.0          369.600000

[12074 rows x 3 columns]

### Which columns are categorical?

In [27]:
df_cats = df.drop(columns=df_nums.columns)
df_cats

,customer,state,gender,education,customer_lifetime_value,number_of_open_complaints,policy_type,vehicle_class
0,RB50392,Washington,NaN,Master,NaN,1/0/00,Personal Auto,Four-Door Car
1,QZ44356,Arizona,F,Bachelor,697953.59%,1/0/00,Personal Auto,Four-Door Car
2,AI49188,Nevada,F,Bachelor,1288743.17%,1/0/00,Personal Auto,Two-Door Car
3,WW63253,California,M,Bachelor,764586.18%,1/0/00,Corporate Auto,SUV
4,GA49547,Washington,M,High School or Below,536307.65%,1/0/00,Personal Auto,Four-Door Car
...,...,...,...,...,...,...,...,...
7065,LA72316,California,M,Bachelor,23406,0,Personal Auto,Four-Door Car
7066,PK87824,California,F,College,3096.51,0,Corporate Auto,Four-Door Car
7067,TD14365,California,M,Bachelor,8163.89,3,Corporate Auto,Four-Door Car
7068,UP19263,California,M,College,7524.44,0,Personal Auto,Four-Door Car
7069,Y167826,California,M,College,2611.84,0,Corporate Auto,Two-Door Car

# Perform the data cleaning operations mentioned so far in class

### Delete the column education and the number of open complaints from the dataframe.

In [28]:
df = df.drop(['education'],axis=1)

In [29]:
df = df.drop(['number_of_open_complaints'],axis=1)

### Check for duplicate rows in the data and remove if any.

In [30]:
df.duplicated().sum()

2939

In [31]:
df = df.drop_duplicates(subset = ['customer'], keep = 'first')
df

,customer,state,gender,customer_lifetime_value,income,monthly_premium_auto,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,697953.59%,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,1288743.17%,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,764586.18%,0.0,106.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,536307.65%,36357.0,68.0,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...
7065,LA72316,California,M,23406,71941.0,73.0,Personal Auto,Four-Door Car,198.234764
7066,PK87824,California,F,3096.51,21604.0,79.0,Corporate Auto,Four-Door Car,379.200000
7067,TD14365,California,M,8163.89,0.0,85.0,Corporate Auto,Four-Door Car,790.784983
7068,UP19263,California,M,7524.44,21941.0,96.0,Personal Auto,Four-Door Car,691.200000
7069,Y167826,California,M,2611.84,0.0,77.0,Corporate Auto,Two-Door Car,369.600000

In [32]:
df.duplicated().sum()

0

### Filter out the data for customers who have an income of 0 or less.

In [33]:
df = df[df.income > 0]

df

,customer,state,gender,customer_lifetime_value,income,monthly_premium_auto,policy_type,vehicle_class,total_claim_amount
2,AI49188,Nevada,F,1288743.17%,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
4,GA49547,Washington,M,536307.65%,36357.0,68.0,Personal Auto,Four-Door Car,17.269323
5,OC83172,Oregon,F,825629.78%,62902.0,69.0,Personal Auto,Two-Door Car,159.383042
6,XZ87318,Oregon,F,538089.86%,55350.0,67.0,Corporate Auto,Four-Door Car,321.600000
8,DY87989,Oregon,M,2412750.40%,14072.0,71.0,Corporate Auto,Four-Door Car,511.200000
...,...,...,...,...,...,...,...,...,...
7063,TF56202,California,M,5032.17,66367.0,64.0,Personal Auto,Two-Door Car,307.200000
7064,YM19146,California,F,4100.4,47761.0,104.0,Personal Auto,Four-Door Car,541.282007
7065,LA72316,California,M,23406,71941.0,73.0,Personal Auto,Four-Door Car,198.234764
7066,PK87824,California,F,3096.51,21604.0,79.0,Corporate Auto,Four-Door Car,379.200000
7068,UP19263,California,M,7524.44,21941.0,96.0,Personal Auto,Four-Door Car,691.200000

In [34]:
# cleaning the gender column 
df_cats['gender'].value_counts()

F         4560
M         4368
Male        40
female      30
Femal       17
Name: gender, dtype: int64

In [35]:
trans_dct = {'Male': 'M',
             'female':'F',
             'Femal':'F',
             'F':'F',
             'M':'M',
            }


df_cats['gender'] = df_cats['gender'].map(trans_dct)
df_cats['gender'].value_counts()

F    4607
M    4408
Name: gender, dtype: int64

In [36]:
# looking at same values 
df_cats['state'].value_counts()

California    3032
Oregon        2601
Arizona       1630
Nevada         882
Washington     768
Cali           120
AZ              74
WA              30
Name: state, dtype: int64

In [37]:
df_cats['policy_type'].value_counts()

Personal Auto     6792
Corporate Auto    1965
Special Auto       380
Name: policy_type, dtype: int64

In [38]:
df_cats['education'].value_counts()

Bachelor                2719
College                 2682
High School or Below    2616
Master                   752
Doctor                   344
Bachelors                 24
Name: education, dtype: int64


### Correct the values in the column customer lifetime value. They are given as a percent, so multiply them by 100 and change dtype to numerical type.

In [39]:
df_nums = df._get_numeric_data()
df_nums

       income  monthly_premium_auto  total_claim_amount
2     48767.0                 108.0          566.472247
4     36357.0                  68.0           17.269323
5     62902.0                  69.0          159.383042
6     55350.0                  67.0          321.600000
8     14072.0                  71.0          511.200000
...       ...                   ...                 ...
7063  66367.0                  64.0          307.200000
7064  47761.0                 104.0          541.282007
7065  71941.0                  73.0          198.234764
7066  21604.0                  79.0          379.200000
7068  21941.0                  96.0          691.200000

[6771 rows x 3 columns]

In [40]:
df_cats = df.drop(columns=df_nums.columns)
df_cats

,customer,state,gender,customer_lifetime_value,policy_type,vehicle_class
2,AI49188,Nevada,F,1288743.17%,Personal Auto,Two-Door Car
4,GA49547,Washington,M,536307.65%,Personal Auto,Four-Door Car
5,OC83172,Oregon,F,825629.78%,Personal Auto,Two-Door Car
6,XZ87318,Oregon,F,538089.86%,Corporate Auto,Four-Door Car
8,DY87989,Oregon,M,2412750.40%,Corporate Auto,Four-Door Car
...,...,...,...,...,...,...
7063,TF56202,California,M,5032.17,Personal Auto,Two-Door Car
7064,YM19146,California,F,4100.4,Personal Auto,Four-Door Car
7065,LA72316,California,M,23406,Personal Auto,Four-Door Car
7066,PK87824,California,F,3096.51,Corporate Auto,Four-Door Car
7068,UP19263,California,M,7524.44,Personal Auto,Four-Door Car

In [41]:
def clean_clv(x):
    return float(str(x).replace('%', ''))*100



df_cats['customer_lifetime_value'] = df_cats['customer_lifetime_value'].apply(clean_clv)
df_cats

,customer,state,gender,customer_lifetime_value,policy_type,vehicle_class
2,AI49188,Nevada,F,1.288743e+08,Personal Auto,Two-Door Car
4,GA49547,Washington,M,5.363076e+07,Personal Auto,Four-Door Car
5,OC83172,Oregon,F,8.256298e+07,Personal Auto,Two-Door Car
6,XZ87318,Oregon,F,5.380899e+07,Corporate Auto,Four-Door Car
8,DY87989,Oregon,M,2.412750e+08,Corporate Auto,Four-Door Car
...,...,...,...,...,...,...
7063,TF56202,California,M,5.032165e+05,Personal Auto,Two-Door Car
7064,YM19146,California,F,4.100399e+05,Personal Auto,Four-Door Car
7065,LA72316,California,M,2.340599e+06,Personal Auto,Four-Door Car
7066,PK87824,California,F,3.096511e+05,Corporate Auto,Four-Door Car
7068,UP19263,California,M,7.524442e+05,Personal Auto,Four-Door Car

In [42]:
# joining df_cats and df_nums DataFrames

In [43]:
df_cats.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6771 entries, 2 to 7068
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   customer                 6771 non-null   object
 1   state                    6771 non-null   object
 2   gender                   6673 non-null   object
 3   customer_lifetime_value  6766 non-null   float64
 4   policy_type              6771 non-null   object
 5   vehicle_class            6771 non-null   object
dtypes: float64(1), object(5)
memory usage: 370.3+ KB

In [44]:
df_nums.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6771 entries, 2 to 7068
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   income                6771 non-null   float64
 1   monthly_premium_auto  6771 non-null   float64
 2   total_claim_amount    6771 non-null   float64
dtypes: float64(3)
memory usage: 211.6 KB

In [45]:
for i in df_nums:
    df_cats[i] =  df_nums[i]

In [46]:
new_df = df_cats

In [47]:
new_df = new_df[['customer', 'state', 'gender', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'policy_type', 'vehicle_class', 'total_claim_amount']]

In [48]:
new_df.head()

,customer,state,gender,customer_lifetime_value,income,monthly_premium_auto,policy_type,vehicle_class,total_claim_amount
2,AI49188,Nevada,F,128874317.0,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
4,GA49547,Washington,M,53630765.0,36357.0,68.0,Personal Auto,Four-Door Car,17.269323
5,OC83172,Oregon,F,82562978.0,62902.0,69.0,Personal Auto,Two-Door Car,159.383042
6,XZ87318,Oregon,F,53808986.0,55350.0,67.0,Corporate Auto,Four-Door Car,321.600000
8,DY87989,Oregon,M,241275040.0,14072.0,71.0,Corporate Auto,Four-Door Car,511.200000